RT-Thread-Studio/sdk-csp-gd32f5/drivers/rtt/drv_i2c.c
#define I2C_WAIT_FLAG_GD_SET_TIMEOUT_RET0(periph, flag, flag_name) \
    do { \
        volatile uint32_t timeout = I2C_TIMEOUT_VALUE; \
        while(!i2c_flag_get_gd(periph, flag) && timeout--)
        { \
            if (timeout == 0)
            { \
                rt_kprintf("[I2C] Timeout waiting for GD flag %s (periph=0x%08x)\n", flag_name, periph); \
                return 0; \
            } \
        } \
    } while(0)

#define I2C_WAIT_FLAG_SET_TIMEOUT_RETI(periph, flag, flag_name) \
    do { \
        volatile uint32_t timeout = I2C_TIMEOUT_VALUE; \
        while(!i2c_flag_get(periph, flag) && timeout--)
        { \
            if (timeout == 0)
            { \
                rt_kprintf("[I2C] Timeout waiting for flag %s (periph=0x%08x)\n", flag_name, periph); \
                return i; \
            } \
        } \
    } while(0)

#define I2C_WAIT_FLAG_RESET_TIMEOUT_RETI(periph, flag, flag_name) \
    do { \
        volatile uint32_t timeout = I2C_TIMEOUT_VALUE; \
        while(i2c_flag_get(periph, flag) && timeout--)
        { \
            if (timeout == 0)
            { \
                rt_kprintf("[I2C] Timeout waiting for flag %s (periph=0x%08x)\n", flag_name, periph); \
                return i; \
            } \
        } \
    } while(0)

#define I2C_WAIT_FLAG_GD_RESET_TIMEOUT_RETI(periph, flag, flag_name) \
    do { \
        volatile uint32_t timeout = I2C_TIMEOUT_VALUE; \
        while(i2c_flag_get_gd(periph, flag) && timeout--)
        { \
            if (timeout == 0)
            { \
                rt_kprintf("[I2C] Timeout waiting for GD flag %s (periph=0x%08x)\n", flag_name, periph); \
                return i; \
            } \
        } \
    } while(0)

#define I2C_WAIT_FLAG_GD_SET_TIMEOUT_GOTO(periph, flag, flag_name, label) \
    do { \
        volatile uint32_t timeout = I2C_TIMEOUT_VALUE; \
        while(!i2c_flag_get_gd(periph, flag) && timeout--)
        { \
            if (timeout == 0)
            { \
                rt_kprintf("[I2C] Timeout waiting for GD flag %s (periph=0x%08x)\n", flag_name, periph); \
                goto label; \
            } \
        } \
    } while(0)

#define I2C_WAIT_CTL_BIT_RESET_TIMEOUT_GOTO(periph, bit_mask, bit_name, label) \
    do { \
        volatile uint32_t timeout = I2C_TIMEOUT_VALUE; \
        while((I2C_CTL0(periph) & bit_mask) && timeout--)
        { \
            if (timeout == 0)
            { \
                rt_kprintf("[I2C] Timeout waiting for CTL bit %s (periph=0x%08x)\n", bit_name, periph); \
                goto label; \
            } \
        } \
    } while(0)

/**
 * @brief  This function initializes the i2c pin.
 * @param  i2c
 * @retval None
 */
static void gd32_i2c_gpio_init(const struct gd32_i2c_bus *i2c)
{
    rt_uint32_t scl_port, sda_port;
    rt_uint32_t scl_pin, sda_pin;
    rt_uint32_t pin_af;
    rcu_periph_enum scl_periph, sda_periph;

    if (get_pin_config(i2c->scl_pin_name, &scl_port, &scl_pin, &scl_periph) == -RT_ERROR)
    {
        return;
    }

    if (get_pin_config(i2c->sda_pin_name, &sda_port, &sda_pin, &sda_periph) == -RT_ERROR)
    {
        return;
    }

    pin_alternate_config(i2c->alternate, &pin_af);

    /* enable I2C and GPIO clock */
    rcu_periph_clock_enable(scl_periph);
    rcu_periph_clock_enable(sda_periph);
    rcu_periph_clock_enable(i2c->per_clk);

    /* configure I2C_SCL as alternate function push-pull */

#if defined(SOC_SERIES_GD32E51x)

    gpio_init(scl_port, GPIO_MODE_AF_OD, GPIO_OSPEED_10MHZ, scl_pin);
    gpio_init(sda_port, GPIO_MODE_AF_OD, GPIO_OSPEED_10MHZ, sda_pin);

    if (!IS_I2C_LEGACY(i2c->i2c_periph))
    {
        rcu_periph_clock_enable(RCU_AF);
        gpio_afio_port_config(AFIO_PA8_I2C2_CFG, ENABLE);
        gpio_afio_port_config(AFIO_PC9_I2C2_CFG, ENABLE);
    }
    else
    {
        i2c_deinit(i2c->i2c_periph);
    }

    /* configure remap function */
    if (i2c->i2c_remap != 0)
    {
        rcu_periph_clock_enable(RCU_AF);
        gpio_pin_remap_config(i2c->i2c_remap, ENABLE);
    }

    gpio_init(scl_port, GPIO_MODE_AF_OD, GPIO_OSPEED_10MHZ, scl_pin);
    gpio_init(sda_port, GPIO_MODE_AF_OD, GPIO_OSPEED_10MHZ, sda_pin);

    /* configure alternate1 function */
    if (pin_af != 0 || pin_af != 0)
    {
        rcu_periph_clock_enable(RCU_AF);
        gpio_afio_port_config(pin_af, ENABLE);
        gpio_afio_port_config(pin_af, ENABLE);
    }

    i2c_deinit(i2c->i2c_periph);

#else
    gpio_af_set(scl_port, pin_af, scl_pin);
    gpio_mode_set(scl_port, GPIO_MODE_AF, GPIO_PUPD_PULLUP, scl_pin);
#if defined(SOC_SERIES_GD32H7xx) || defined(SOC_SERIES_GD32H75E)
    gpio_output_options_set(scl_port, GPIO_OTYPE_OD, GPIO_OSPEED_60MHZ, scl_pin);
    /* configure I2C_SDA as alternate function push-pull */
    gpio_af_set(sda_port, pin_af, sda_pin);
    gpio_mode_set(sda_port, GPIO_MODE_AF, GPIO_PUPD_PULLUP, sda_pin);
    gpio_output_options_set(sda_port, GPIO_OTYPE_OD, GPIO_OSPEED_60MHZ, sda_pin);
#else
    gpio_output_options_set(scl_port, GPIO_OTYPE_OD, GPIO_OSPEED_50MHZ, scl_pin);
    /* configure I2C_SDA as alternate function push-pull */
    gpio_af_set(sda_port, pin_af, sda_pin);
    gpio_mode_set(sda_port, GPIO_MODE_AF, GPIO_PUPD_PULLUP, sda_pin);
    gpio_output_options_set(sda_port, GPIO_OTYPE_OD, GPIO_OSPEED_50MHZ, sda_pin);
#endif
#endif
}

/**
  * @brief  read data.
  * @param  i2c_periph
  * @param  *p_buffer
  * @param  data_byte
  * @retval None
  */
static uint8_t gd32_i2c_read(rt_uint32_t i2c_periph, rt_uint8_t *p_buffer, rt_uint16_t data_byte)
{
    if (data_byte == 0)
        return 1;

#if defined(SOC_SERIES_GD32F5xx) || defined(SOC_SERIES_GD32F4xx) || defined(SOC_SERIES_GD32E51x)
    if (IS_I2C_LEGACY(i2c_periph))
    {
        /* 参考官方 at24cxx.c 的多字节读逻辑
           使用remaining(剩余字节数)而非循环索引,逻辑更清晰

           1字节读: 直接等RBNE读取
           2字节读: 剩余2字节时等BTC+禁ACK(配合ACKPOS_NEXT),然后读2字节
           3+字节读: 剩余3字节时等BTC+禁ACK,然后读完剩余字节
        */

        rt_uint16_t remaining = data_byte;

        while (remaining > 0)
        {
            /* 3+字节读: 当剩余3字节时,等BTC后禁ACK */
            if (data_byte >= 3 && remaining == 3)
            {
                I2C_WAIT_FLAG_SET_TIMEOUT_RET0(i2c_periph, I2C_FLAG_BTC, "BTC");
                i2c_ack_config(i2c_periph, I2C_ACK_DISABLE);
            }

            /* 2字节读: ACK已在ADDSEND后禁用，这里只需按RBNE读取两个字节 */

            /* 等待RBNE并读取一个字节 */
            I2C_WAIT_FLAG_SET_TIMEOUT_RET0(i2c_periph, I2C_FLAG_RBNE, "RBNE");
            *p_buffer = i2c_data_receive(i2c_periph);
            p_buffer++;
            remaining--;
        }

