RT-Thread-Studio/sdk-csp-gd32f5/drivers/rtt/drv_i2c.c
        return 0;
    }
    else
#endif
    {
        /* 新I2C(ADD)外设的读 */
        while (data_byte)
        {
            I2C_WAIT_FLAG_GD_SET_TIMEOUT_RET0(i2c_periph, I2C_FLAG_RBNE_GD, "RBNE_GD");
            *p_buffer = i2c_data_receive_gd(i2c_periph);
            p_buffer++;
            data_byte--;
        }
        return 0;
    }
}

/**
  * @brief  write data.
  * @param  i2c_periph
  * @param  *p_buffer
  * @param  data_byte
  * @retval None
  */
static uint8_t gd32_i2c_write(rt_uint32_t i2c_periph, uint8_t *p_buffer, uint16_t data_byte)
{
    if (data_byte == 0)
        return 1;

    while (data_byte)
    {
#if defined(SOC_SERIES_GD32F5xx) || defined(SOC_SERIES_GD32F4xx) || defined(SOC_SERIES_GD32E51x)
        if (IS_I2C_LEGACY(i2c_periph))
        {
            /* data transmission */
            i2c_data_transmit(i2c_periph, *p_buffer);
            /* point to the next byte to be written */
            p_buffer++;
            /* decrement the write bytes counter */
            data_byte--;
            /* wait until the TI bit is set */
            I2C_WAIT_FLAG_SET_TIMEOUT_RET0(i2c_periph, I2C_FLAG_BTC, "BTC");
        }
        else
#endif
        {
#if defined(SOC_SERIES_GD32F5xx) || defined(SOC_SERIES_GD32H7xx) || defined(SOC_SERIES_GD32H75E) || defined(SOC_SERIES_GD32L23x) || defined(SOC_SERIES_GD32E51x)
            /* wait until the transmit data buffer is empty */
            I2C_STAT_GD(i2c_periph) |= I2C_STAT_TBE_GD;
            I2C_WAIT_FLAG_SET_TIMEOUT_RET0(i2c_periph, I2C_FLAG_TBE, "TBE");
                ;

            while (data_byte)
            {
                /* wait until the TI bit is set */
                I2C_WAIT_FLAG_SET_TIMEOUT_RET0(i2c_periph, I2C_FLAG_TI_GD, "TI_GD");
                /* data transmission */
                i2c_data_transmit(i2c_periph, *p_buffer);
                /* point to the next byte to be written */
                p_buffer++;
                /* decrement the write bytes counter */
                data_byte--;
            }
#endif
        }
    }

    if (data_byte != 0)
    {
        return 1;
    }
    return 0;
}

static rt_ssize_t gd32_i2c_master_xfer(struct rt_i2c_bus_device *bus, struct rt_i2c_msg msgs[], rt_uint32_t num)
{
    static struct rt_i2c_msg *msg;

    rt_uint32_t i, w_total_byte = 0, r_total_byte = 0;
    rt_err_t ret = RT_ERROR;

    RT_ASSERT(bus != RT_NULL);

    struct gd32_i2c_bus *gd32_i2c = (struct gd32_i2c_bus *)bus->priv;

    for (i = 0; i < num; i++)
    {
        msg = &msgs[i];

        if (msg->flags & RT_I2C_RD)
        {
            r_total_byte += msg->len;
        }
        else
        {
            w_total_byte += msg->len;
        }
    }

    for (i = 0; i < num; i++)
    {
        msg = &msgs[i];
        if (!(msg->flags & RT_I2C_NO_START))
        {
#if defined(SOC_SERIES_GD32F5xx) || defined(SOC_SERIES_GD32F4xx) || defined(SOC_SERIES_GD32E51x)
            if (IS_I2C_LEGACY(gd32_i2c->i2c_periph))
            {
                if (msg->flags & RT_I2C_RD)
                {
                    /* 根据读取字节数配置ACK策略 */
                    if (1 == msg->len)
                    {
                        /* 1字节读：禁用ACK（在ADDSEND之前） */
                        i2c_ack_config(gd32_i2c->i2c_periph, I2C_ACK_DISABLE);
                    }
                    else if (msg->len == 2)
                    {
                        /* 2字节读：启用ACK + 配置ACKPOS_NEXT */
                        i2c_ack_config(gd32_i2c->i2c_periph, I2C_ACK_ENABLE);
                        i2c_ackpos_config(gd32_i2c->i2c_periph, I2C_ACKPOS_NEXT);
                    }
                    else
                    {
                        /* 3+字节读：启用ACK（后续在gd32_i2c_read中管理） */
                        i2c_ack_config(gd32_i2c->i2c_periph, I2C_ACK_ENABLE);
                    }

                    /* 对于Repeated START（i > 0）可能不需要等待I2CBSY清空 */
                    if (i == 0)
                    {
                        /* 第一个消息：等待总线空闲 */
                        I2C_WAIT_FLAG_RESET_TIMEOUT_RETI(gd32_i2c->i2c_periph, I2C_FLAG_I2CBSY, "I2CBSY");
                    }
                    /* 否则总线可能仍然忙碌（Repeated START情况），直接发送START */

                    /* send the start signal */
                    i2c_start_on_bus(gd32_i2c->i2c_periph);
                    /* i2c master sends START signal successfully */
                    I2C_WAIT_FLAG_SET_TIMEOUT(gd32_i2c->i2c_periph, I2C_FLAG_SBSEND, "SBSEND");

                    /* 发送读地址 */
                    i2c_master_addressing(gd32_i2c->i2c_periph, msg->addr, I2C_RECEIVER);

                    /* 等待ADDSEND标志 */
                    I2C_WAIT_FLAG_SET_TIMEOUT_RETI(gd32_i2c->i2c_periph, I2C_FLAG_ADDSEND, "ADDSEND");
                    i2c_flag_clear(gd32_i2c->i2c_periph, I2C_FLAG_ADDSEND);

                    /* 2字节读的正确时序：ADDSEND后立刻禁用ACK（配合ACKPOS_NEXT） */
                    if (msg->len == 2)
                    {
                        i2c_ack_config(gd32_i2c->i2c_periph, I2C_ACK_DISABLE);
                    }
                }
                else
                {
                    /* 写操作：如果总线busy先清理 */
                    if (i == 0 && i2c_flag_get(gd32_i2c->i2c_periph, I2C_FLAG_I2CBSY))
                    {
                        /* 第一个消息且总线忙：发送STOP等待空闲 */
                        i2c_stop_on_bus(gd32_i2c->i2c_periph);
                        I2C_WAIT_FLAG_RESET_TIMEOUT_RETI(gd32_i2c->i2c_periph, I2C_FLAG_I2CBSY, "I2CBSY");
                    }
                    /* 否则可能是Repeated START，总线可能仍忙 */

                    /* send a start condition to I2C bus */
                    i2c_start_on_bus(gd32_i2c->i2c_periph);
                    I2C_WAIT_FLAG_SET_TIMEOUT(gd32_i2c->i2c_periph, I2C_FLAG_SBSEND, "SBSEND");

                    i2c_master_addressing(gd32_i2c->i2c_periph, msg->addr, I2C_TRANSMITTER);
                    I2C_WAIT_FLAG_SET_TIMEOUT_RETI(gd32_i2c->i2c_periph, I2C_FLAG_ADDSEND, "ADDSEND");
                    i2c_flag_clear(gd32_i2c->i2c_periph, I2C_FLAG_ADDSEND);
                }
            }
            else
#endif
            {
#if defined(SOC_SERIES_GD32F5xx) || defined(SOC_SERIES_GD32H7xx) || defined(SOC_SERIES_GD32H75E) || defined(SOC_SERIES_GD32L23x) || defined(SOC_SERIES_GD32E51x)
                if (msg->flags & RT_I2C_ADDR_10BIT)
                {
                        /* enable 10-bit addressing mode in master mode */
                    i2c_address10_enable_gd(gd32_i2c->i2c_periph);
                }
                else
                {
                        /* disable 10-bit addressing mode in master mode */
                    i2c_address10_disable_gd(gd32_i2c->i2c_periph);
                }

                if (msg->flags & RT_I2C_RD)
                {
                     /* configure slave address */
                    i2c_master_addressing_gd(gd32_i2c->i2c_periph, msg->addr, I2C_MASTER_RECEIVE_GD);

                    i2c_transfer_byte_number_config_gd(gd32_i2c->i2c_periph, r_total_byte);
                     /* send a start condition to I2C bus */
                    i2c_start_on_bus_gd(gd32_i2c->i2c_periph);
                }
                else
                {
                     /* configure slave address */
                    i2c_master_addressing_gd(gd32_i2c->i2c_periph, msg->addr, I2C_MASTER_TRANSMIT_GD);
                    I2C_WAIT_FLAG_GD_RESET_TIMEOUT_RETI(gd32_i2c->i2c_periph, I2C_FLAG_I2CBSY_GD, "I2CBSY_GD");
                    i2c_transfer_byte_number_config_gd(gd32_i2c->i2c_periph, w_total_byte);
                     /* send a start condition to I2C bus */
                    i2c_start_on_bus_gd(gd32_i2c->i2c_periph);
                }
#endif
            }
        }

        if (msg->flags & RT_I2C_RD)
        {
            if (gd32_i2c_read(gd32_i2c->i2c_periph, msg->buf, msg->len) != 0)
            {
                LOG_E("i2c bus read failed,i2c bus stop!");
                goto out;
            }
        }
        else
        {
            if (gd32_i2c_write(gd32_i2c->i2c_periph, msg->buf, msg->len) != 0)
            {
                LOG_E("i2c bus write failed,i2c bus stop!");
                goto out;
            }
        }
#if defined(SOC_SERIES_GD32F5xx) || defined(SOC_SERIES_GD32H7xx) || defined(SOC_SERIES_GD32H75E) || defined(SOC_SERIES_GD32L23x) || defined(SOC_SERIES_GD32E51x)
        if (!IS_I2C_LEGACY(gd32_i2c->i2c_periph))
        {
            if (r_total_byte != 0)
            {
                I2C_WAIT_FLAG_GD_SET_TIMEOUT_GOTO(gd32_i2c->i2c_periph, I2C_FLAG_TC_GD, "TC_GD", out);
            }
        }
#endif
    }
    ret = i;

out:
#if defined(SOC_SERIES_GD32F5xx) || defined(SOC_SERIES_GD32F4xx) || defined(SOC_SERIES_GD32E51x)
    if (IS_I2C_LEGACY(gd32_i2c->i2c_periph))
    {
        if (!(msg->flags & RT_I2C_NO_STOP))
        {
            /* 检查是否还有下一条消息（Repeated START 情况） */
            rt_bool_t is_last_msg = (i == (num - 1));
            rt_bool_t next_msg_same_addr = !is_last_msg && (msgs[i + 1].addr == msg->addr);

