RT-Thread-Studio/sdk-csp-gd32f5/drivers/rtt/drv_i2c.c
            if (is_last_msg || !next_msg_same_addr)
            {
                /* 最后一条消息或地址改变：发送STOP */
                if (msg->flags & RT_I2C_RD)
                {
                    /* 读操作：禁用ACK后发送STOP */
                    i2c_ack_config(gd32_i2c->i2c_periph, I2C_ACK_DISABLE);
                    i2c_stop_on_bus(gd32_i2c->i2c_periph);
                    I2C_WAIT_CTL_BIT_RESET_TIMEOUT_GOTO(gd32_i2c->i2c_periph, I2C_CTL0_STOP, "STOP", final_cleanup);
                }
                else
                {
                    /* 写操作：等待BTC后发送STOP */
                    i2c_stop_on_bus(gd32_i2c->i2c_periph);
                    I2C_WAIT_CTL_BIT_RESET_TIMEOUT_GOTO(gd32_i2c->i2c_periph, I2C_CTL0_STOP, "STOP", final_cleanup);
                }
            }
            /* 否则下一条消息会发 Repeated START，不发 STOP */
        }
    }
    else
#endif
    {
#if defined(SOC_SERIES_GD32F5xx) || defined(SOC_SERIES_GD32H7xx) || defined(SOC_SERIES_GD32H75E) || defined(SOC_SERIES_GD32L23x) || defined(SOC_SERIES_GD32E51x)
        if (!(msg->flags & RT_I2C_NO_STOP))
        {
            I2C_WAIT_FLAG_GD_SET_TIMEOUT_GOTO(gd32_i2c->i2c_periph, I2C_FLAG_TC_GD, "TC_GD", final_cleanup);
            /* send a stop condition to I2C bus */
            i2c_stop_on_bus_gd(gd32_i2c->i2c_periph);
            /* wait until stop condition generate */
            I2C_WAIT_FLAG_GD_SET_TIMEOUT_GOTO(gd32_i2c->i2c_periph, I2C_FLAG_STPDET_GD, "STPDET_GD", final_cleanup);
            /* clear the STPDET bit */
            i2c_flag_clear_gd(gd32_i2c->i2c_periph, I2C_FLAG_STPDET_GD);
        }
#endif
    }
final_cleanup:
    return ret;
}

static const struct rt_i2c_bus_device_ops i2c_ops = {
    .master_xfer = gd32_i2c_master_xfer,
    .slave_xfer = RT_NULL,
    .i2c_bus_control = RT_NULL
};

/**
  * @brief  I2C initialization function
  * @param  None
  * @retval RT_EOK indicates successful initialization.
  */
int rt_hw_i2c_init(void)
{
    rt_size_t obj_num = sizeof(gd_i2c_config) / sizeof(gd_i2c_config[0]);

    for (int i = 0; i < obj_num; i++)
    {
        gd32_i2c_gpio_init(&gd_i2c_config[i]);

        /* configure I2C timing. I2C speed clock=400kHz*/
#if defined(SOC_SERIES_GD32F5xx) || defined(SOC_SERIES_GD32F4xx) || defined(SOC_SERIES_GD32E51x)
        if (IS_I2C_LEGACY(gd_i2c_config[i].i2c_periph))
        {
            i2c_clock_config(gd_i2c_config[i].i2c_periph, 100000, I2C_DTCY_2);
            i2c_mode_addr_config(gd_i2c_config[i].i2c_periph, I2C_I2CMODE_ENABLE, I2C_ADDFORMAT_7BITS, 0xa0);
            i2c_enable(gd_i2c_config[i].i2c_periph);
            i2c_ack_config(gd_i2c_config[i].i2c_periph, I2C_ACK_ENABLE);
        }
        else
#endif
        {
#if defined(SOC_SERIES_GD32F5xx) || defined(SOC_SERIES_GD32H7xx) || defined(SOC_SERIES_GD32H75E) || defined(SOC_SERIES_GD32L23x) || defined(SOC_SERIES_GD32E51x)
            i2c_timing_config_gd(gd_i2c_config[i].i2c_periph, 0x1, 0x7, 0);
            i2c_master_clock_config_gd(gd_i2c_config[i].i2c_periph, 0x2D, 0x87);

            /* enable I2C1 */
            i2c_enable_gd(gd_i2c_config[i].i2c_periph);
#endif
        }

        gd_i2c_config[i].i2c_bus->ops = &i2c_ops;
        gd_i2c_config[i].i2c_bus->priv = (void *)&gd_i2c_config[i];

        rt_i2c_bus_device_register(gd_i2c_config[i].i2c_bus, gd_i2c_config[i].device_name);
    }

    return RT_EOK;
}

INIT_BOARD_EXPORT(rt_hw_i2c_init);

#endif /* RT_USING_I2C */

